Repository: jansater/RS.Assert
Catalog: TypeLess/Properties/Resources.*.resx
Languages: sv

# BoolIsFalse
source: <name> must be true
sv: <name> krävs

# BoolIsTrue
source: <name> must be false
sv: <name> måste vara falskt

# ContainsKey
source: <name> must not contain key {0}
sv: <name> måste innehålla nyckeln {0}

# ContainsLessThan
source: <name> must contain more than {0} items
sv: <name> måste innehålla fler än {0} element

# ContainsMoreThan
source: <name> must contain less than {0} items
sv: <name> måste innehålle färre än {0} element

# DoesNotContain
source: <name> must contain text {0}
sv: <name> måste innehålla texten {0}

# DoesNotContainAlphaChars
source: <name> must contain alpha numeric characters
sv: <name> måste innehålla alfanumeriska tecken

# DoesNotContainDigit
source: <name> must contain at least 1 digit
sv: <name> måste innehålla minst 1 siffra

# DoesNotContainKey
source: <name> must contain key {0}
sv: <name> måste innehålla nyckeln {0}

# DoesNotEndWith
source: <name> must end with text {0}
sv: <name> måste sluta med texten {0}

# DoesNotMatch
source: <name> must match pattern {0}
sv: <name> måste matcha mönstret {0}

# DoesNotStartWith
source: <name> must start with text {0}
sv: <name> måste börja med texten {0}

# IsAfter
source: <name> must be smaller than {0}
sv: <name> måste vara mindre än {0}

# IsBefore
source: <name> must be larger than {0}
sv: <name> måste vara större än {0}

# IsEmpty
source: <name> must not be empty
sv: <name> får inte vara tom

# IsEqualTo
source: <name> must not be equal to {0}
sv: <name> får inte vara lika med {0}

# IsGreaterThan
source: <name> must be smaller than {0}
sv: <name> måste vara mindre än {0}

# IsLongerThan
source: <name> must be shorter than {0} characters
sv: <name> måste vara kortare än {0} tecken

# IsNegative
source: <name> must be zero or positive
sv: <name> måste vara noll eller positiv

# IsNotEqualTo
source: <name> must be equal to {0}
sv: <name> måste vara lika med {0}

# IsNotNull
source: <name> must be null
sv: <name> måste vara null

# IsNotValidEmail
source: <name> must be a valid email address
sv: <name> måste vara en giltig e-postadress

# IsNotValidImoNr
source: <name> must be a valid IMO number
sv: <name> måste vara ett giltig IMO-nummer

# IsNotValidISBN
source: <name> must be a valid ISBN
sv: <name> måste vara ett giltig ISBN-nummer

# IsNotValidPersonalNumber
source: <name> must be a valid personal number
sv: <name> måste vara ett giltig personnummer

# IsNotValidPhoneNumber
source: <name> must be a valid phone number
sv: <name> måste vara ett giltig telefonnummer

# IsNotValidSocialSecurityNumber
source: <name> must be a valid social security number
sv: <name> måste vara ett giltig social security nummer

# IsNotValidUrl
source: <name> must be a valid URL
sv: <name> måste vara en giltig URL

# IsNotValidZipCode
source: <name> must be a valid zip code
sv: <name> måste vara en giltig zip-kod

# IsNotWithin
source: <name> must be within {0} and {1}
sv: <name> måste vara inom {0} och {1}

# IsNull
source: <name> is required
sv: <name> krävs

# IsPositive
source: <name> must be zero or negative
sv: <name> måste vara noll eller negativ

# IsShorterThan
source: <name> must be longer than {0} characters
sv: <name> måste vara längre än {0} tecken

# IsSmallerThan
source: <name> must be greater than {0}
sv: <name> måste vara större än {0}

# IsValidISBN
source: <name> must not be a ISBN
sv: <name> får inte vara ett ISBN-nummer

# IsValidPersonalNumber
source: <name> must not be a valid personal number
sv: <name> får inte vara ett personnummer

# IsValidPhoneNumber
source: <name> must not be a valid phone number
sv: <name> får inte vara ett telefonnummer

# IsValidSocialSecurityNumber
source: <name> must not be a social security number
sv: <name> får inte vara ett social security nummer

# IsValidUrl
source: <name> must not be a URL
sv: <name> får inte vara en URL

# IsValidZipCode
source: <name> must not be a zip code
sv: <name> får inte vara en zip-kod

# IsWithin
source: <name> must not be within {0} and {1}
sv: <name> får inte vara inom {0} och {1}

# IsZero
source: <name> must be non zero
sv: <name> får inte vara noll

# NotSameDayAs
source: <name> must be on same day as {0}
sv: <name> måste vara på samma dag som {0}

# NotSameHourAs
source: <name> must be on same hour as {0}
sv: <name> måste vara på samma timme som {0}

# NotSameMinuteAs
source: <name> must be on same minute as {0}
sv: <name> måste vara på samma minut som {0}

# NotSameMonthAs
source: <name> must be on same month as {0}
sv: <name> måste vara på samma månad som {0}

# NotSameSecondAs
source: <name> must be on same second as {0}
sv: <name> måste vara på samma sekund som {0}

# NotSameWeekDayAs
source: <name> must be on same week day as {0}
sv: <name> måste vara på samma veckodag som {0}

# NotSameYearAs
source: <name> must be on same year as {0}
sv: <name> måste vara på samma år som {0}

# SameDayAs
source: <name> must not be on same day as {0}
sv: <name> får inte vara på samma dag som {0}

# SameHourAs
source: <name> must not be on same hour as {0}
sv: <name> får inte vara på samma timme som {0}

# SameMinuteAs
source: <name> must not be on same minute as {0}
sv: <name> får inte vara på samma minut som {0}

# SameMonthAs
source: <name> must not be on same month as {0}
sv: <name> får inte vara på samma månad som {0}

# SameSecondAs
source: <name> must not be on same second as {0}
sv: <name> får inte vara på samma sekund som {0}

# SameWeekDayAs
source: <name> must not be on same week day as {0}
sv: <name> får inte vara på samma veckodag som {0}

# SameYearAs
source: <name> must not be on same year as {0}
sv: <name> får inte vara på samma år som {0}

# TimeSpanIsLongerThan
source: <name> must be shorter than {0:c}
sv: <name> måste vara kortare än {0:c}

# TimeSpanIsShorterThan
source: <name> must be longer than {0:c}
sv: <name> måste vara längre än {0:c}
